7767517
114 142
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296
Swish                    silu_41                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Swish                    silu_42                  1 1 3 4
Convolution              conv_4                   1 1 4 5 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_43                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,48,48 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_5                   1 1 11 12 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_44                  1 1 12 13
Convolution              conv_6                   1 1 13 14 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_45                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Split                    splitncnn_1              1 3 16 17 18 19
Convolution              conv_7                   1 1 19 20 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_46                  1 1 20 21
Convolution              conv_8                   1 1 21 22 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_47                  1 1 22 23
BinaryOp                 add_1                    2 1 18 23 24 0=0
Concat                   cat_0                    4 1 7 9 17 24 25 0=0
Convolution              conv_9                   1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_48                  1 1 26 27
Convolution              conv_10                  1 1 27 28 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Swish                    silu_49                  1 1 28 29
Convolution              conv_11                  1 1 29 30 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_50                  1 1 30 31
Slice                    split_1                  1 2 31 32 33 -23300=2,96,96 1=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_12                  1 1 36 37 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_51                  1 1 37 38
Convolution              conv_13                  1 1 38 39 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_52                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_14                  1 1 44 45 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_53                  1 1 45 46
Convolution              conv_15                  1 1 46 47 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_54                  1 1 47 48
BinaryOp                 add_3                    2 1 43 48 49 0=0
Split                    splitncnn_4              1 3 49 50 51 52
Convolution              conv_16                  1 1 52 53 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_55                  1 1 53 54
Convolution              conv_17                  1 1 54 55 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_56                  1 1 55 56
BinaryOp                 add_4                    2 1 51 56 57 0=0
Split                    splitncnn_5              1 3 57 58 59 60
Convolution              conv_18                  1 1 60 61 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_57                  1 1 61 62
Convolution              conv_19                  1 1 62 63 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_58                  1 1 63 64
BinaryOp                 add_5                    2 1 59 64 65 0=0
Concat                   cat_1                    6 1 32 34 42 50 58 65 66 0=0
Convolution              conv_20                  1 1 66 67 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_59                  1 1 67 68
Convolution              conv_21                  1 1 68 69 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=663552
Swish                    silu_60                  1 1 69 70
Convolution              conv_22                  1 1 70 71 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_61                  1 1 71 72
Slice                    split_2                  1 2 72 73 74 -23300=2,192,192 1=0
Split                    splitncnn_6              1 3 74 75 76 77
Convolution              conv_23                  1 1 77 78 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_62                  1 1 78 79
Convolution              conv_24                  1 1 79 80 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_63                  1 1 80 81
BinaryOp                 add_6                    2 1 76 81 82 0=0
Split                    splitncnn_7              1 3 82 83 84 85
Convolution              conv_25                  1 1 85 86 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_64                  1 1 86 87
Convolution              conv_26                  1 1 87 88 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_65                  1 1 88 89
BinaryOp                 add_7                    2 1 84 89 90 0=0
Split                    splitncnn_8              1 3 90 91 92 93
Convolution              conv_27                  1 1 93 94 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_66                  1 1 94 95
Convolution              conv_28                  1 1 95 96 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_67                  1 1 96 97
BinaryOp                 add_8                    2 1 92 97 98 0=0
Split                    splitncnn_9              1 3 98 99 100 101
Convolution              conv_29                  1 1 101 102 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_68                  1 1 102 103
Convolution              conv_30                  1 1 103 104 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_69                  1 1 104 105
BinaryOp                 add_9                    2 1 100 105 106 0=0
Concat                   cat_2                    6 1 73 75 83 91 99 106 107 0=0
Convolution              conv_31                  1 1 107 108 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=442368
Swish                    silu_70                  1 1 108 109
Convolution              conv_32                  1 1 109 110 0=768 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2654208
Swish                    silu_71                  1 1 110 111
Convolution              conv_33                  1 1 111 112 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=589824
Swish                    silu_72                  1 1 112 113
Slice                    split_3                  1 2 113 114 115 -23300=2,384,384 1=0
Split                    splitncnn_10             1 3 115 116 117 118
Convolution              conv_34                  1 1 118 119 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_73                  1 1 119 120
Convolution              conv_35                  1 1 120 121 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_74                  1 1 121 122
BinaryOp                 add_10                   2 1 117 122 123 0=0
Split                    splitncnn_11             1 3 123 124 125 126
Convolution              conv_36                  1 1 126 127 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_75                  1 1 127 128
Convolution              conv_37                  1 1 128 129 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_76                  1 1 129 130
BinaryOp                 add_11                   2 1 125 130 131 0=0
Concat                   cat_3                    4 1 114 116 124 131 132 0=0
Convolution              conv_38                  1 1 132 133 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1179648
Swish                    silu_77                  1 1 133 134
Convolution              conv_39                  1 1 134 135 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=983040
Swish                    silu_78                  1 1 135 136
Pooling                  gap_1                    1 1 136 137 0=1 4=1
Reshape                  reshape_79               1 1 137 138 0=1 1=1 2=-1
Flatten                  flatten_80               1 1 138 139
InnerProduct             linear_40                1 1 139 140 0=1000 1=1 2=1280000
Softmax                  softmax_0                1 1 140 out0 0=0 1=1
