7767517
268 324
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296
Swish                    silu_99                  1 1 1 2
Convolution              conv_1                   1 1 2 3 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Swish                    silu_100                 1 1 3 4
Convolution              conv_2                   1 1 4 5 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_101                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,48,48 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_102                 1 1 12 13
Convolution              conv_4                   1 1 13 14 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_103                 1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Split                    splitncnn_1              1 3 16 17 18 19
Convolution              conv_5                   1 1 19 20 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_104                 1 1 20 21
Convolution              conv_6                   1 1 21 22 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_105                 1 1 22 23
BinaryOp                 add_1                    2 1 18 23 24 0=0
Concat                   cat_0                    4 1 7 9 17 24 25 0=0
Convolution              conv_7                   1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_106                 1 1 26 27
Convolution              conv_8                   1 1 27 28 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Swish                    silu_107                 1 1 28 29
Convolution              conv_9                   1 1 29 30 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_108                 1 1 30 31
Slice                    split_1                  1 2 31 32 33 -23300=2,96,96 1=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_10                  1 1 36 37 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_109                 1 1 37 38
Convolution              conv_11                  1 1 38 39 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_110                 1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_12                  1 1 44 45 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_111                 1 1 45 46
Convolution              conv_13                  1 1 46 47 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_112                 1 1 47 48
BinaryOp                 add_3                    2 1 43 48 49 0=0
Split                    splitncnn_4              1 3 49 50 51 52
Convolution              conv_14                  1 1 52 53 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_113                 1 1 53 54
Convolution              conv_15                  1 1 54 55 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_114                 1 1 55 56
BinaryOp                 add_4                    2 1 51 56 57 0=0
Split                    splitncnn_5              1 3 57 58 59 60
Convolution              conv_16                  1 1 60 61 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_115                 1 1 61 62
Convolution              conv_17                  1 1 62 63 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_116                 1 1 63 64
BinaryOp                 add_5                    2 1 59 64 65 0=0
Concat                   cat_1                    6 1 32 34 42 50 58 65 66 0=0
Convolution              conv_18                  1 1 66 67 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_117                 1 1 67 68
Split                    splitncnn_6              1 2 68 69 70
Convolution              conv_19                  1 1 70 71 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=663552
Swish                    silu_118                 1 1 71 72
Convolution              conv_20                  1 1 72 73 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_119                 1 1 73 74
Slice                    split_2                  1 2 74 75 76 -23300=2,192,192 1=0
Split                    splitncnn_7              1 3 76 77 78 79
Convolution              conv_21                  1 1 79 80 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_120                 1 1 80 81
Convolution              conv_22                  1 1 81 82 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_121                 1 1 82 83
BinaryOp                 add_6                    2 1 78 83 84 0=0
Split                    splitncnn_8              1 3 84 85 86 87
Convolution              conv_23                  1 1 87 88 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_122                 1 1 88 89
Convolution              conv_24                  1 1 89 90 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_123                 1 1 90 91
BinaryOp                 add_7                    2 1 86 91 92 0=0
Split                    splitncnn_9              1 3 92 93 94 95
Convolution              conv_25                  1 1 95 96 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_124                 1 1 96 97
Convolution              conv_26                  1 1 97 98 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_125                 1 1 98 99
BinaryOp                 add_8                    2 1 94 99 100 0=0
Split                    splitncnn_10             1 3 100 101 102 103
Convolution              conv_27                  1 1 103 104 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_126                 1 1 104 105
Convolution              conv_28                  1 1 105 106 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_127                 1 1 106 107
BinaryOp                 add_9                    2 1 102 107 108 0=0
Concat                   cat_2                    6 1 75 77 85 93 101 108 109 0=0
Convolution              conv_29                  1 1 109 110 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=442368
Swish                    silu_128                 1 1 110 111
Split                    splitncnn_11             1 2 111 112 113
Convolution              conv_30                  1 1 113 114 0=576 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1990656
Swish                    silu_129                 1 1 114 115
Convolution              conv_31                  1 1 115 116 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=331776
Swish                    silu_130                 1 1 116 117
Slice                    split_3                  1 2 117 118 119 -23300=2,288,288 1=0
Split                    splitncnn_12             1 3 119 120 121 122
Convolution              conv_32                  1 1 122 123 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_131                 1 1 123 124
Convolution              conv_33                  1 1 124 125 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_132                 1 1 125 126
BinaryOp                 add_10                   2 1 121 126 127 0=0
Split                    splitncnn_13             1 3 127 128 129 130
Convolution              conv_34                  1 1 130 131 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_133                 1 1 131 132
Convolution              conv_35                  1 1 132 133 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_134                 1 1 133 134
BinaryOp                 add_11                   2 1 129 134 135 0=0
Concat                   cat_3                    4 1 118 120 128 135 136 0=0
Convolution              conv_36                  1 1 136 137 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_135                 1 1 137 138
Convolution              conv_37                  1 1 138 139 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_136                 1 1 139 140
Split                    splitncnn_14             1 2 140 141 142
Pooling                  maxpool2d_96             1 1 142 143 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 143 144 145
Pooling                  maxpool2d_97             1 1 145 146 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_16             1 2 146 147 148
Pooling                  maxpool2d_98             1 1 148 149 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 141 144 147 149 150 0=0
Convolution              conv_38                  1 1 150 151 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_137                 1 1 151 152
Split                    splitncnn_17             1 2 152 153 154
Interp                   upsample_185             1 1 154 155 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 155 112 156 0=0
Convolution              conv_39                  1 1 156 157 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=368640
Swish                    silu_138                 1 1 157 158
Slice                    split_4                  1 2 158 159 160 -23300=2,192,192 1=0
Split                    splitncnn_18             1 2 160 161 162
Convolution              conv_40                  1 1 162 163 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_139                 1 1 163 164
Convolution              conv_41                  1 1 164 165 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_140                 1 1 165 166
Split                    splitncnn_19             1 2 166 167 168
Convolution              conv_42                  1 1 168 169 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_141                 1 1 169 170
Convolution              conv_43                  1 1 170 171 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_142                 1 1 171 172
Concat                   cat_6                    4 1 159 161 167 172 173 0=0
Convolution              conv_44                  1 1 173 174 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_143                 1 1 174 175
Split                    splitncnn_20             1 2 175 176 177
Interp                   upsample_186             1 1 177 178 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 178 69 179 0=0
Convolution              conv_45                  1 1 179 180 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_144                 1 1 180 181
Slice                    split_5                  1 2 181 182 183 -23300=2,96,96 1=0
Split                    splitncnn_21             1 2 183 184 185
Convolution              conv_46                  1 1 185 186 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_145                 1 1 186 187
Convolution              conv_47                  1 1 187 188 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_146                 1 1 188 189
Split                    splitncnn_22             1 2 189 190 191
Convolution              conv_48                  1 1 191 192 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_147                 1 1 192 193
Convolution              conv_49                  1 1 193 194 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_148                 1 1 194 195
Concat                   cat_8                    4 1 182 184 190 195 196 0=0
Convolution              conv_50                  1 1 196 197 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_149                 1 1 197 198
Split                    splitncnn_23             1 5 198 199 200 201 202 203
Convolution              conv_51                  1 1 203 204 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776
Swish                    silu_150                 1 1 204 205
Concat                   cat_9                    2 1 205 176 206 0=0
Convolution              conv_52                  1 1 206 207 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=221184
Swish                    silu_151                 1 1 207 208
Slice                    split_6                  1 2 208 209 210 -23300=2,192,192 1=0
Split                    splitncnn_24             1 2 210 211 212
Convolution              conv_53                  1 1 212 213 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_152                 1 1 213 214
Convolution              conv_54                  1 1 214 215 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_153                 1 1 215 216
Split                    splitncnn_25             1 2 216 217 218
Convolution              conv_55                  1 1 218 219 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_154                 1 1 219 220
Convolution              conv_56                  1 1 220 221 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_155                 1 1 221 222
Concat                   cat_10                   4 1 209 211 217 222 223 0=0
Convolution              conv_57                  1 1 223 224 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_156                 1 1 224 225
Split                    splitncnn_26             1 4 225 226 227 228 229
Convolution              conv_58                  1 1 229 230 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1327104
Swish                    silu_157                 1 1 230 231
Concat                   cat_11                   2 1 231 153 232 0=0
Convolution              conv_59                  1 1 232 233 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=552960
Swish                    silu_158                 1 1 233 234
Slice                    split_7                  1 2 234 235 236 -23300=2,288,288 1=0
Split                    splitncnn_27             1 2 236 237 238
Convolution              conv_60                  1 1 238 239 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_159                 1 1 239 240
Convolution              conv_61                  1 1 240 241 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_160                 1 1 241 242
Split                    splitncnn_28             1 2 242 243 244
Convolution              conv_62                  1 1 244 245 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_161                 1 1 245 246
Convolution              conv_63                  1 1 246 247 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496
Swish                    silu_162                 1 1 247 248
Concat                   cat_12                   4 1 235 237 243 248 249 0=0
Convolution              conv_64                  1 1 249 250 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_163                 1 1 250 251
Split                    splitncnn_29             1 3 251 252 253 254
Convolution              conv_65                  1 1 202 255 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_164                 1 1 255 256
Deconvolution            deconv_95                1 1 256 257 0=192 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=147456
Convolution              conv_66                  1 1 257 258 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_165                 1 1 258 259
Convolution              conv_67                  1 1 259 260 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_166                 1 1 260 out2
Convolution              conv_68                  1 1 201 262 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_167                 1 1 262 263
Convolution              conv_69                  1 1 263 264 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_168                 1 1 264 265
Convolution              conv_70                  1 1 265 266 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Reshape                  view_187                 1 1 266 267 0=-1 1=32
Permute                  transpose_193            1 1 267 268 0=1
Convolution              conv_71                  1 1 228 269 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=165888
Swish                    silu_169                 1 1 269 270
Convolution              conv_72                  1 1 270 271 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_170                 1 1 271 272
Convolution              conv_73                  1 1 272 273 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Reshape                  view_188                 1 1 273 274 0=-1 1=32
Permute                  transpose_194            1 1 274 275 0=1
Convolution              conv_74                  1 1 254 276 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=248832
Swish                    silu_171                 1 1 276 277
Convolution              conv_75                  1 1 277 278 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_172                 1 1 278 279
Convolution              conv_76                  1 1 279 280 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Reshape                  view_189                 1 1 280 281 0=-1 1=32
Permute                  transpose_195            1 1 281 282 0=1
Concat                   cat_13                   3 1 268 275 282 out1 0=0
Convolution              conv_77                  1 1 200 284 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
Swish                    silu_173                 1 1 284 285
Convolution              conv_78                  1 1 285 286 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_174                 1 1 286 287
Convolution              conv_79                  1 1 287 288 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_80                  1 1 199 289 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_175                 1 1 289 290
Convolution              conv_81                  1 1 290 291 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_176                 1 1 291 292
Convolution              conv_82                  1 1 292 293 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_14                   2 1 288 293 294 0=0
Convolution              conv_83                  1 1 227 295 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=221184
Swish                    silu_177                 1 1 295 296
Convolution              conv_84                  1 1 296 297 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_178                 1 1 297 298
Convolution              conv_85                  1 1 298 299 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_86                  1 1 226 300 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=663552
Swish                    silu_179                 1 1 300 301
Convolution              conv_87                  1 1 301 302 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_180                 1 1 302 303
Convolution              conv_88                  1 1 303 304 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_15                   2 1 299 304 305 0=0
Convolution              conv_89                  1 1 253 306 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_181                 1 1 306 307
Convolution              conv_90                  1 1 307 308 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_182                 1 1 308 309
Convolution              conv_91                  1 1 309 310 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_92                  1 1 252 311 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=995328
Swish                    silu_183                 1 1 311 312
Convolution              conv_93                  1 1 312 313 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_184                 1 1 313 314
Convolution              conv_94                  1 1 314 315 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_16                   2 1 310 315 316 0=0
Reshape                  view_190                 1 1 294 317 0=-1 1=144
Permute                  transpose_196            1 1 317 318 0=1
Reshape                  view_191                 1 1 305 319 0=-1 1=144
Permute                  transpose_197            1 1 319 320 0=1
Reshape                  view_192                 1 1 316 321 0=-1 1=144
Permute                  transpose_198            1 1 321 322 0=1
Concat                   cat_17                   3 1 318 320 322 out0 0=0
